backend/load-tests/scenarios/baseline.yaml
config:
  target: 'http://localhost:4000/api/v1'
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Warm up
    - duration: 120
      arrivalRate: 50
      name: Sustained max load
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: "../scripts/seed.js"

scenarios:
  - name: "Health Check and Base Endpoints"
    flow:
      - get:
          url: "/health"
      - think: 1
      - get:
          url: "/auth/status"
          # Depending on actual API route