backend/load-tests/scenarios/stress.yaml
config:
  target: 'http://localhost:4000/api/v1'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Warm up
    - duration: 120
      arrivalRate: 100
      rampTo: 500
      name: Ramp to Stress
    - duration: 60
      arrivalRate: 500
      name: Sustained Stress Load
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Intensive AI and DB Requests"
    flow:
      - get:
          url: "/health"
      - post:
          url: "/ai/chat"
          json:
            message: "What are the latest business trends?"